# -*-coding:utf-8-*-
"""
随机变量可能取得的值，可以把它们分为两种基本类型：离散型和连续型

离散型随机变量即在一定区间内变量取值为有限个或可数个。
离散型随机变量根据不同的概率分布有伯努利分布、二项分布、几何分布、泊松分布、超几何分布等。

连续型随机变量即在一定区间内变量取值有无限个，或数值无法一一列举出来。
连续型随机变量根据不同的概率分布有均匀分布、指数分布、正态分布、伽马分布等。
"""

"""
随机变量的性质主要有两类：
一类是大而全的性质，这类性质可以详细描述述所有可能取值的概率，
例如描述连续型随机变量的累积分布函数（Cumulative Distribution Function，CDF）、
概率密度函数（Probability Density Function，PDF），
描述离散型随机变量的概率质量分布函数（Probability Mass Function，PMF）等；

另一类是找 到 该 随 机 变 量 的 一 些 特 征 或 代 表 值 ， 
例 如 随 机 变 量 的 方 差
（Variance）、期望（Expectation）、置信区间等数字特征。
"""



